astb_relise/src/DataProcessors/ВыгрузкаДанныхВТСД/ВыгрузкаДанныхВТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхВТСД</name>
  <comment>Выгрузка данных в терминал сбора данных</comment>
</mdclass:DataProcessor>

astb_relise/src/InformationRegisters/ШтрихкодыНоменклатурыДляУчетаЧистки/ШтрихкодыНоменклатурыДляУчетаЧистки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатурыДляУчетаЧистки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/DataProcessors/ВыгрузкаДанныхВТСД/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьВыполнить()

	ЗаполнитьБазуТоваров();

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВыполнить()

	ОчиститьСообщения();
	
	ТаблицаЗагрузкиТоваров = Новый Массив;
	Для Каждого Товар ИЗ ТаблицаВыгрузки Цикл
		ТаблицаЗагрузкиТоваров.Добавить(Новый Структура("Код, Штрихкод, Номенклатура, ЕдиницаИзмерения, ХарактеристикаНоменклатуры, СерияНоменклатуры, Качество, Цена, Остаток",
		Товар.SKU, Товар.Штрихкод, Товар.Наименование, Товар.ЕдиницаИзмерения, Товар.Характеристика, Товар.Серия, Товар.Качество, Товар.Цена, 0));
	КонецЦикла;
	МенеджерОборудованияКлиент.ВыгрузитьДанныеВТСД(УникальныйИдентификатор, ТаблицаЗагрузкиТоваров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСписокТоваров(Команда)
	
	ОчиститьСообщения();
	
	МенеджерОборудованияКлиент.ОчиститьДанныеВТСД(УникальныйИдентификатор);
	           
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьБазуТоваров()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Штрихкод,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.Наименование КАК НаименованиеСотрудника,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Сотрудник.ТабельныйНомер КАК ТабельныйНомерСотрудника,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Наименование КАК НаименованиеНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.КодСинхронизации КАК КодСинхронизацииНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.Номенклатура.Артикул КАК АртикулНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.Наименование КАК ХарактеристикаНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ДатаВыдачи КАК ДатаВыдачи
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатурыДляУчетаЧистки КАК ШтрихкодыНоменклатурыДляУчетаЧистки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеСотрудника,
	|	НаименованиеНоменклатуры,
	|	ШтрихкодыНоменклатурыДляУчетаЧистки.ХарактеристикаНоменклатуры.КодSAP,
	|	ДатаВыдачи";
	
	ЗначениеВРеквизитФормы(Запрос.Выполнить().Выгрузить(), "ТаблицаВыгрузки");

КонецПроцедуры
